
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |      102 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                     |
|:--------:|:--------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.ci-tester["actions-runner-tester"].aws_iam_role.role-tester`                                          |
|    🟢    | `module.ci-tester["actions-runner-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`          |
|    🟢    | `module.ci-tester["actions-runner-tester"].aws_iam_role_policy_attachment.role-permissions`                   |
|    🟢    | `module.ci-tester["actions-runner-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`            |
|    🟢    | `module.ci-tester["aerospike-tester"].aws_iam_role.role-tester`                                               |
|    🟢    | `module.ci-tester["aerospike-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`               |
|    🟢    | `module.ci-tester["aerospike-tester"].aws_iam_role_policy_attachment.role-permissions`                        |
|    🟢    | `module.ci-tester["aerospike-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                 |
|    🟢    | `module.ci-tester["bookstack-tester"].aws_iam_role.role-tester`                                               |
|    🟢    | `module.ci-tester["bookstack-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`               |
|    🟢    | `module.ci-tester["bookstack-tester"].aws_iam_role_policy_attachment.role-permissions`                        |
|    🟢    | `module.ci-tester["bookstack-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                 |
|    🟢    | `module.ci-tester["cloud-init-tester"].aws_iam_role.role-tester`                                              |
|    🟢    | `module.ci-tester["cloud-init-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`              |
|    🟢    | `module.ci-tester["cloud-init-tester"].aws_iam_role_policy_attachment.role-permissions`                       |
|    🟢    | `module.ci-tester["cloud-init-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                |
|    🟢    | `module.ci-tester["debian-repo-tester"].aws_iam_role.role-tester`                                             |
|    🟢    | `module.ci-tester["debian-repo-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`             |
|    🟢    | `module.ci-tester["debian-repo-tester"].aws_iam_role_policy_attachment.role-permissions`                      |
|    🟢    | `module.ci-tester["debian-repo-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`               |
|    🟢    | `module.ci-tester["ecr-tester"].aws_iam_role.role-tester`                                                     |
|    🟢    | `module.ci-tester["ecr-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                     |
|    🟢    | `module.ci-tester["ecr-tester"].aws_iam_role_policy_attachment.role-permissions`                              |
|    🟢    | `module.ci-tester["ecr-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                       |
|    🟢    | `module.ci-tester["ecs-tester"].aws_iam_role.role-tester`                                                     |
|    🟢    | `module.ci-tester["ecs-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                     |
|    🟢    | `module.ci-tester["ecs-tester"].aws_iam_role_policy_attachment.role-permissions`                              |
|    🟢    | `module.ci-tester["ecs-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                       |
|    🟢    | `module.ci-tester["elasticsearch-tester"].aws_iam_role.role-tester`                                           |
|    🟢    | `module.ci-tester["elasticsearch-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`           |
|    🟢    | `module.ci-tester["elasticsearch-tester"].aws_iam_role_policy_attachment.role-permissions`                    |
|    🟢    | `module.ci-tester["elasticsearch-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`             |
|    🟢    | `module.ci-tester["gha-admin-tester"].aws_iam_role.role-tester`                                               |
|    🟢    | `module.ci-tester["gha-admin-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`               |
|    🟢    | `module.ci-tester["gha-admin-tester"].aws_iam_role_policy_attachment.role-permissions`                        |
|    🟢    | `module.ci-tester["gha-admin-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                 |
|    🟢    | `module.ci-tester["github-role-tester"].aws_iam_role.role-tester`                                             |
|    🟢    | `module.ci-tester["github-role-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`             |
|    🟢    | `module.ci-tester["github-role-tester"].aws_iam_role_policy_attachment.role-permissions`                      |
|    🟢    | `module.ci-tester["github-role-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`               |
|    🟢    | `module.ci-tester["guardduty-configuration-tester"].aws_iam_role.role-tester`                                 |
|    🟢    | `module.ci-tester["guardduty-configuration-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]` |
|    🟢    | `module.ci-tester["guardduty-configuration-tester"].aws_iam_role_policy_attachment.role-permissions`          |
|    🟢    | `module.ci-tester["guardduty-configuration-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`   |
|    🟢    | `module.ci-tester["instance-profile-tester"].aws_iam_role.role-tester`                                        |
|    🟢    | `module.ci-tester["instance-profile-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`        |
|    🟢    | `module.ci-tester["instance-profile-tester"].aws_iam_role_policy_attachment.role-permissions`                 |
|    🟢    | `module.ci-tester["instance-profile-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`          |
|    🟢    | `module.ci-tester["jumphost-tester"].aws_iam_role.role-tester`                                                |
|    🟢    | `module.ci-tester["jumphost-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                |
|    🟢    | `module.ci-tester["jumphost-tester"].aws_iam_role_policy_attachment.role-permissions`                         |
|    🟢    | `module.ci-tester["jumphost-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                  |
|    🟢    | `module.ci-tester["kibana-tester"].aws_iam_role.role-tester`                                                  |
|    🟢    | `module.ci-tester["kibana-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                  |
|    🟢    | `module.ci-tester["kibana-tester"].aws_iam_role_policy_attachment.role-permissions`                           |
|    🟢    | `module.ci-tester["kibana-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                    |
|    🟢    | `module.ci-tester["openvpn-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                 |
|    🟢    | `module.ci-tester["openvpn-tester"].aws_iam_role_policy_attachment.role-permissions`                          |
|    🟢    | `module.ci-tester["openvpn-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                   |
|    🟢    | `module.ci-tester["postfix-tester"].aws_iam_role.role-tester`                                                 |
|    🟢    | `module.ci-tester["postfix-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                 |
|    🟢    | `module.ci-tester["postfix-tester"].aws_iam_role_policy_attachment.role-permissions`                          |
|    🟢    | `module.ci-tester["postfix-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                   |
|    🟢    | `module.ci-tester["pypiserver-tester"].aws_iam_role.role-tester`                                              |
|    🟢    | `module.ci-tester["pypiserver-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`              |
|    🟢    | `module.ci-tester["pypiserver-tester"].aws_iam_role_policy_attachment.role-permissions`                       |
|    🟢    | `module.ci-tester["pypiserver-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                |
|    🟢    | `module.ci-tester["secret-tester"].aws_iam_role.role-tester`                                                  |
|    🟢    | `module.ci-tester["secret-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                  |
|    🟢    | `module.ci-tester["secret-tester"].aws_iam_role_policy_attachment.role-permissions`                           |
|    🟢    | `module.ci-tester["secret-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                    |
|    🟢    | `module.ci-tester["service-network-tester"].aws_iam_role.role-tester`                                         |
|    🟢    | `module.ci-tester["service-network-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`         |
|    🟢    | `module.ci-tester["service-network-tester"].aws_iam_role_policy_attachment.role-permissions`                  |
|    🟢    | `module.ci-tester["service-network-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`           |
|    🟢    | `module.ci-tester["sqs-ecs-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                 |
|    🟢    | `module.ci-tester["sqs-ecs-tester"].aws_iam_role_policy_attachment.role-permissions`                          |
|    🟢    | `module.ci-tester["sqs-ecs-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                   |
|    🟢    | `module.ci-tester["sqs-pod-tester"].aws_iam_role.role-tester`                                                 |
|    🟢    | `module.ci-tester["sqs-pod-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                 |
|    🟢    | `module.ci-tester["sqs-pod-tester"].aws_iam_role_policy_attachment.role-permissions`                          |
|    🟢    | `module.ci-tester["sqs-pod-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                   |
|    🟢    | `module.ci-tester["state-bucket-tester"].aws_iam_role.role-tester`                                            |
|    🟢    | `module.ci-tester["state-bucket-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`            |
|    🟢    | `module.ci-tester["state-bucket-tester"].aws_iam_role_policy_attachment.role-permissions`                     |
|    🟢    | `module.ci-tester["state-bucket-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`              |
|    🟢    | `module.ci-tester["tags-override-tester"].aws_iam_role.role-tester`                                           |
|    🟢    | `module.ci-tester["tags-override-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`           |
|    🟢    | `module.ci-tester["tags-override-tester"].aws_iam_role_policy_attachment.role-permissions`                    |
|    🟢    | `module.ci-tester["tags-override-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`             |
|    🟢    | `module.ci-tester["tcp-pod-tester"].aws_iam_role.role-tester`                                                 |
|    🟢    | `module.ci-tester["tcp-pod-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`                 |
|    🟢    | `module.ci-tester["tcp-pod-tester"].aws_iam_role_policy_attachment.role-permissions`                          |
|    🟢    | `module.ci-tester["tcp-pod-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`                   |
|    🟢    | `module.ci-tester["terraformer-tester"].aws_iam_role.role-tester`                                             |
|    🟢    | `module.ci-tester["terraformer-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`             |
|    🟢    | `module.ci-tester["terraformer-tester"].aws_iam_role_policy_attachment.role-permissions`                      |
|    🟢    | `module.ci-tester["terraformer-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`               |
|    🟢    | `module.ci-tester["website-pod-tester"].aws_iam_role.role-tester`                                             |
|    🟢    | `module.ci-tester["website-pod-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0]`             |
|    🟢    | `module.ci-tester["website-pod-tester"].aws_iam_role_policy_attachment.role-permissions`                      |
|    🟢    | `module.ci-tester["website-pod-tester"].aws_iam_role_policy_attachment.role-pytest-permissions`               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ci-tester["actions-runner-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/actions-runner-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-actions-runner:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-actions-runner"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "actions-runner-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["actions-runner-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "actions-runner-tester"
    }

  # module.ci-tester["actions-runner-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/actions-runner-tester-permissions2025060815124104510000002d"
      + role       = "actions-runner-tester"
    }

  # module.ci-tester["actions-runner-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151239866400000019"
      + role       = "actions-runner-tester"
    }

  # module.ci-tester["aerospike-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/aerospike-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-aerospike:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-aerospike"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "aerospike-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["aerospike-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "aerospike-tester"
    }

  # module.ci-tester["aerospike-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/aerospike-tester-permissions2025060815124110430000002f"
      + role       = "aerospike-tester"
    }

  # module.ci-tester["aerospike-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123570870000000e"
      + role       = "aerospike-tester"
    }

  # module.ci-tester["bookstack-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/bookstack-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-bookstack:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-bookstack"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "bookstack-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["bookstack-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "bookstack-tester"
    }

  # module.ci-tester["bookstack-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/bookstack-tester-permissions2025060815124084120000002a"
      + role       = "bookstack-tester"
    }

  # module.ci-tester["bookstack-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123990700000001a"
      + role       = "bookstack-tester"
    }

  # module.ci-tester["cloud-init-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/cloud-init-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-cloud-init:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-cloud-init"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "cloud-init-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["cloud-init-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "cloud-init-tester"
    }

  # module.ci-tester["cloud-init-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/cloud-init-tester-permissions20250608151240712400000028"
      + role       = "cloud-init-tester"
    }

  # module.ci-tester["cloud-init-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151233740800000008"
      + role       = "cloud-init-tester"
    }

  # module.ci-tester["debian-repo-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/debian-repo-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-debian-repo:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-debian-repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "debian-repo-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["debian-repo-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "debian-repo-tester"
    }

  # module.ci-tester["debian-repo-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/debian-repo-tester-permissions20250608151240315700000020"
      + role       = "debian-repo-tester"
    }

  # module.ci-tester["debian-repo-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151233361100000005"
      + role       = "debian-repo-tester"
    }

  # module.ci-tester["ecr-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/ecr-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-ecr:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-ecr"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "ecr-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["ecr-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "ecr-tester"
    }

  # module.ci-tester["ecr-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/ecr-tester-permissions20250608151240516000000024"
      + role       = "ecr-tester"
    }

  # module.ci-tester["ecr-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123574050000000f"
      + role       = "ecr-tester"
    }

  # module.ci-tester["ecs-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/ecs-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-ecs:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-ecs"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "ecs-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["ecs-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "ecs-tester"
    }

  # module.ci-tester["ecs-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/ecs-tester-permissions20250608151240716100000029"
      + role       = "ecs-tester"
    }

  # module.ci-tester["ecs-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151235908500000010"
      + role       = "ecs-tester"
    }

  # module.ci-tester["elasticsearch-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/elasticsearch-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-elasticsearch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-elasticsearch"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "elasticsearch-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["elasticsearch-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "elasticsearch-tester"
    }

  # module.ci-tester["elasticsearch-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/elasticsearch-tester-permissions20250608151240520300000025"
      + role       = "elasticsearch-tester"
    }

  # module.ci-tester["elasticsearch-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151233332700000004"
      + role       = "elasticsearch-tester"
    }

  # module.ci-tester["gha-admin-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/gha-admin-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-gha-admin:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-gha-admin"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "gha-admin-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["gha-admin-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "gha-admin-tester"
    }

  # module.ci-tester["gha-admin-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/gha-admin-tester-permissions20250608151240329900000023"
      + role       = "gha-admin-tester"
    }

  # module.ci-tester["gha-admin-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123430270000000a"
      + role       = "gha-admin-tester"
    }

  # module.ci-tester["github-role-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/github-role-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-github-role:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-github-role"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "github-role-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["github-role-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "github-role-tester"
    }

  # module.ci-tester["github-role-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/github-role-tester-permissions2025060815124109950000002e"
      + role       = "github-role-tester"
    }

  # module.ci-tester["github-role-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123450710000000b"
      + role       = "github-role-tester"
    }

  # module.ci-tester["guardduty-configuration-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/guardduty-configuration-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-guardduty-configuration:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-guardduty-configuration"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "guardduty-configuration-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["guardduty-configuration-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "guardduty-configuration-tester"
    }

  # module.ci-tester["guardduty-configuration-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/guardduty-configuration-tester-permissions20250608151241483800000033"
      + role       = "guardduty-configuration-tester"
    }

  # module.ci-tester["guardduty-configuration-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123991640000001b"
      + role       = "guardduty-configuration-tester"
    }

  # module.ci-tester["instance-profile-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/instance-profile-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-instance-profile:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-instance-profile"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "instance-profile-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["instance-profile-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "instance-profile-tester"
    }

  # module.ci-tester["instance-profile-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/instance-profile-tester-permissions20250608151241290100000030"
      + role       = "instance-profile-tester"
    }

  # module.ci-tester["instance-profile-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151237788800000013"
      + role       = "instance-profile-tester"
    }

  # module.ci-tester["jumphost-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/jumphost-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-jumphost:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-jumphost"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "jumphost-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["jumphost-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "jumphost-tester"
    }

  # module.ci-tester["jumphost-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/jumphost-tester-permissions20250608151240323100000021"
      + role       = "jumphost-tester"
    }

  # module.ci-tester["jumphost-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151234263800000009"
      + role       = "jumphost-tester"
    }

  # module.ci-tester["kibana-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/kibana-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-kibana:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-kibana"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "kibana-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["kibana-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "kibana-tester"
    }

  # module.ci-tester["kibana-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/kibana-tester-permissions20250608151240681800000027"
      + role       = "kibana-tester"
    }

  # module.ci-tester["kibana-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151233538200000006"
      + role       = "kibana-tester"
    }

  # module.ci-tester["openvpn-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "openvpn-tester"
    }

  # module.ci-tester["openvpn-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/openvpn-tester-permissions2025060815124090110000002b"
      + role       = "openvpn-tester"
    }

  # module.ci-tester["openvpn-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151233147200000003"
      + role       = "openvpn-tester"
    }

  # module.ci-tester["postfix-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/postfix-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-postfix:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-postfix"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "postfix-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["postfix-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "postfix-tester"
    }

  # module.ci-tester["postfix-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/postfix-tester-permissions2025060815124010540000001c"
      + role       = "postfix-tester"
    }

  # module.ci-tester["postfix-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123567310000000d"
      + role       = "postfix-tester"
    }

  # module.ci-tester["pypiserver-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/pypiserver-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-pypiserver:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-pypiserver"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "pypiserver-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["pypiserver-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "pypiserver-tester"
    }

  # module.ci-tester["pypiserver-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pypiserver-tester-permissions20250608151241309600000031"
      + role       = "pypiserver-tester"
    }

  # module.ci-tester["pypiserver-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151237832800000014"
      + role       = "pypiserver-tester"
    }

  # module.ci-tester["secret-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/secret-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-secret:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-secret"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "secret-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["secret-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "secret-tester"
    }

  # module.ci-tester["secret-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/secret-tester-permissions2025060815124010860000001d"
      + role       = "secret-tester"
    }

  # module.ci-tester["secret-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151236204500000011"
      + role       = "secret-tester"
    }

  # module.ci-tester["service-network-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/service-network-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-service-network:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-service-network"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "service-network-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["service-network-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "service-network-tester"
    }

  # module.ci-tester["service-network-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/service-network-tester-permissions2025060815124010970000001e"
      + role       = "service-network-tester"
    }

  # module.ci-tester["service-network-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151238410200000017"
      + role       = "service-network-tester"
    }

  # module.ci-tester["sqs-ecs-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "sqs-ecs-tester"
    }

  # module.ci-tester["sqs-ecs-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/sqs-ecs-tester-permissions20250608151232822900000002"
      + role       = "sqs-ecs-tester"
    }

  # module.ci-tester["sqs-ecs-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151227146800000001"
      + role       = "sqs-ecs-tester"
    }

  # module.ci-tester["sqs-pod-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/sqs-pod-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-sqs-pod:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-sqs-pod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "sqs-pod-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["sqs-pod-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "sqs-pod-tester"
    }

  # module.ci-tester["sqs-pod-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/sqs-pod-tester-permissions20250608151240526100000026"
      + role       = "sqs-pod-tester"
    }

  # module.ci-tester["sqs-pod-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions2025060815123547270000000c"
      + role       = "sqs-pod-tester"
    }

  # module.ci-tester["state-bucket-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/state-bucket-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-state-bucket:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-state-bucket"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "state-bucket-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["state-bucket-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "state-bucket-tester"
    }

  # module.ci-tester["state-bucket-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/state-bucket-tester-permissions20250608151241513000000034"
      + role       = "state-bucket-tester"
    }

  # module.ci-tester["state-bucket-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151233589300000007"
      + role       = "state-bucket-tester"
    }

  # module.ci-tester["tags-override-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/tags-override-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-tags-override:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-tags-override"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "tags-override-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["tags-override-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "tags-override-tester"
    }

  # module.ci-tester["tags-override-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/tags-override-tester-permissions20250608151241329400000032"
      + role       = "tags-override-tester"
    }

  # module.ci-tester["tags-override-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151237594700000012"
      + role       = "tags-override-tester"
    }

  # module.ci-tester["tcp-pod-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/tcp-pod-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-tcp-pod:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-tcp-pod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "tcp-pod-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["tcp-pod-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "tcp-pod-tester"
    }

  # module.ci-tester["tcp-pod-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/tcp-pod-tester-permissions2025060815124013430000001f"
      + role       = "tcp-pod-tester"
    }

  # module.ci-tester["tcp-pod-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151239716100000018"
      + role       = "tcp-pod-tester"
    }

  # module.ci-tester["terraformer-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/terraformer-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-terraformer:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-terraformer"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "terraformer-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["terraformer-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "terraformer-tester"
    }

  # module.ci-tester["terraformer-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/terraformer-tester-permissions2025060815124090150000002c"
      + role       = "terraformer-tester"
    }

  # module.ci-tester["terraformer-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151238143300000016"
      + role       = "terraformer-tester"
    }

  # module.ci-tester["website-pod-tester"].aws_iam_role.role-tester will be created
  + resource "aws_iam_role" "role-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnEquals = {
                              + "aws:PrincipalArn" = "arn:aws:iam::303467602807:role/website-pod-tester"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::303467602807:root"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-website-pod:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module infrahouse/terraform-aws-website-pod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "website-pod-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ci-tester["website-pod-tester"].aws_iam_role_policy_attachment.role-admin-permissions[0] will be created
  + resource "aws_iam_role_policy_attachment" "role-admin-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "website-pod-tester"
    }

  # module.ci-tester["website-pod-tester"].aws_iam_role_policy_attachment.role-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/website-pod-tester-permissions20250608151240326300000022"
      + role       = "website-pod-tester"
    }

  # module.ci-tester["website-pod-tester"].aws_iam_role_policy_attachment.role-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "role-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20250608151238031000000015"
      + role       = "website-pod-tester"
    }

Plan: 102 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEwMiwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>